classfields/api-tests/public-api-client/src/main/resources/shark/vtb_status_response.xml

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
    <env:Header>
        <wsa:MessageID xmlns:wsa="http://www.w3.org/2005/08/addressing">1888fe5b-7358-4978-a3e9-ca6724a0fa30
        </wsa:MessageID>
        <wsa:To xmlns:wsa="http://www.w3.org/2005/08/addressing">https://apiauto.ru/1.0/shark/integration/vtb</wsa:To>
        <wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">PreScoringResponse</wsa:Action>
        <wsa:ReplyTo xmlns:wsa="http://www.w3.org/2005/08/addressing">
            <wsa:Address>https://bg.msk.vtb24.ru/BankGatewayIn/Default.ashx</wsa:Address>
        </wsa:ReplyTo>
    </env:Header>
    <env:Body>
        <ns0:AfterFLoanAppUpdateStatusRequest xmlns:ns0="http://vtb24.ru/bankgateway/types">
            <ns0:FLoanAppNumber>А_Авто.руa14svy5unxd</ns0:FLoanAppNumber>
            <ns0:AppNumberChild>13961158</ns0:AppNumberChild>
            <ns0:StateName>Корректировка заявки</ns0:StateName>
            <ns0:DecisionComment>Обоснования для проставления кодов 56/57:1. Мобильный телефон: Уточните и укажите
                корректный номер клиента либо дополнительный номер телефона. По данному номеру никто не отвечает.;
            </ns0:DecisionComment>
            <ns0:MaxMonthlyPayment>10725.7</ns0:MaxMonthlyPayment>
            <ns0:MaxCreditAmountCC>300000.0</ns0:MaxCreditAmountCC>
            <ns0:AppCreditTerm>36</ns0:AppCreditTerm>
            <ns0:AppCreditInterestRate>17.2</ns0:AppCreditInterestRate>
            <ns0:AppCreditAmount>300000</ns0:AppCreditAmount>
        </ns0:AfterFLoanAppUpdateStatusRequest>
    </env:Body>
</env:Envelope>
